# M1L5 More EDA with Pandas 

This notebook will guide you through some essential data manipulation techniques using the Pandas library in Python. We'll be working with the Austin Animal Center Intakes dataset, which contains information about animals entering the Austin Animal Center.

### **Dataset:** [Austin Animal Center Intakes](https://catalog.data.gov/dataset/austin-animal-center-intakes) -- This is also in your data folder 

### **Objectives:**

 1.  Load and explore the dataset.
 2.  Use `groupby()` to aggregate data.
 3.  Create contingency tables using `crosstab()`.
 4.  Identify and handle duplicate entries.

## Step 1:  Import pandas and numpy

In [1]:
#Import packages 

import pandas as pd
import numpy as np

## Step 2:  Load in the data and save it as `df`

In [6]:
df = pd.read_csv('/Users/Marcy_Student/Downloads/Austin_Animal_Center_Intakes__10_01_2013_to_05_05_2025_.csv')

## Step 3:  Look at the data (can you think of some methods to do this)

In [7]:
df.head()

,Animal ID,Name,DateTime,MonthYear,Found Location,Intake Type,Intake Condition,Animal Type,Sex upon Intake,Age upon Intake,Breed,Color
0,A521520,Nina,10/01/2013 07:51:00 AM,October 2013,Norht Ec in Austin (TX),Stray,Normal,Dog,Spayed Female,7 years,Border Terrier/Border Collie,White/Tan
1,A664235,NaN,10/01/2013 08:33:00 AM,October 2013,Abia in Austin (TX),Stray,Normal,Cat,Unknown,1 week,Domestic Shorthair Mix,Orange/White
2,A664236,NaN,10/01/2013 08:33:00 AM,October 2013,Abia in Austin (TX),Stray,Normal,Cat,Unknown,1 week,Domestic Shorthair Mix,Orange/White
3,A664237,NaN,10/01/2013 08:33:00 AM,October 2013,Abia in Austin (TX),Stray,Normal,Cat,Unknown,1 week,Domestic Shorthair Mix,Orange/White
4,A664233,Stevie,10/01/2013 08:53:00 AM,October 2013,7405 Springtime in Austin (TX),Stray,Injured,Dog,Intact Female,3 years,Pit Bull Mix,Blue/White

## Step 4:  Count up how many missing values exist in each column (you would need to chain two methods here -- one to check for missing values and the other to sum missing values up)

In [32]:
for col in df.columns:
    print(pd.value_counts(df[col].isnull()))
    print('')

Animal ID
False    173812
Name: count, dtype: int64

Name
False    123821
True      49991
Name: count, dtype: int64

DateTime
False    173812
Name: count, dtype: int64

MonthYear
False    173812
Name: count, dtype: int64

Found Location
False    173812
Name: count, dtype: int64

Intake Type
False    173812
Name: count, dtype: int64

Intake Condition
False    173812
Name: count, dtype: int64

Animal Type
False    173812
Name: count, dtype: int64

Sex upon Intake
False    173811
True          1
Name: count, dtype: int64

Age upon Intake
False    173812
Name: count, dtype: int64

Breed
False    173812
Name: count, dtype: int64

Color
False    173812
Name: count, dtype: int64

/var/folders/7n/rj4gbkk13_1f9n1qf54j12gh0000gp/T/ipykernel_56805/2000213482.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  print(pd.value_counts(df[col].isnull()))

## Step 5:  Count up the amount of animals by Animal Type

In [14]:
animal_counts = df.groupby('Animal Type')['Animal ID'].count()
print(animal_counts)

Animal Type
Bird           878
Cat          69324
Dog          94608
Livestock       34
Other         8968
Name: Animal ID, dtype: int64

## Step 6:  Create a crosstab showing the count of animal types for each intake condition.

In [17]:
cross_table = pd.crosstab(df['Intake Condition'], df['Animal Type'])
print(cross_table)

Animal Type       Bird    Cat    Dog  Livestock  Other
Intake Condition
Aged                 0     77    445          0      3
Agonal               0      3      1          0      0
Behavior             0      8     73          0      0
Congenital           0      0      1          0      0
Feral                0    133     11          0      1
Injured            249   4339   5000          2   1215
Med Attn             0     27     60          0      0
Med Urgent           0     11     10          0      0
Medical              0    213    391          0     10
Neonatal             1   1467    476          1     26
Neurologic           0      5      6          0      2
Normal             603  57032  83773         28   5705
Nursing              0   2559   1214          0    105
Other                8    110    229          0      6
Panleuk              0      1      0          0      0
Parvo                0      0     11          0      0
Pregnant             0     41    129          0      0
Sick                17   3287   2756          3   1876
Space                0      4      0          0      0
Unknown              0      7     22          0     19

## Step 7:  Check for duplicate Animal IDs (pay close attention to the syntax here)

In [33]:
duplicate_ids = df['Animal ID'].duplicated
print(duplicate_ids)

<bound method Series.duplicated of 0         A521520
1         A664235
2         A664236
3         A664237
4         A664233
           ...
173807    A929690
173808    A929717
173809    A929724
173810    A929725
173811    A929635
Name: Animal ID, Length: 173812, dtype: object>

## Practice Joining Data

### Scenario 1
You have customer data split into two different files (DataFrames),
and you want to combine them into a single DataFrame for analysis.

In [20]:
# Run the cell without changes to create the two dataframes 

customers_part1_df = pd.DataFrame({'CustomerID': [101, 102, 103],
                                   'FirstName': ['Alice', 'Bob', 'Charlie'],
                                   'City': ['Anytown', 'Otherville', 'Smallburg']})

customers_part2_df = pd.DataFrame({'CustomerID': [104, 105, 106],
                                   'FirstName': ['David', 'Emily', 'Frank'],
                                   'City': ['Bigcity', 'Townsville', 'Villageton']})

### Scenario 1 Task:  Use `pd.concat()` to stack the two dataframes above (afterall they have the same columns)

In [24]:
all_customers_df = pd.concat([customers_part1_df,customers_part2_df],ignore_index=1)
all_customers_df

   CustomerID FirstName        City
0         101     Alice     Anytown
1         102       Bob  Otherville
2         103   Charlie   Smallburg
3         104     David     Bigcity
4         105     Emily  Townsville
5         106     Frank  Villageton

### Scenario 2

Combining customer details and loyalty points.

In [30]:
# Run the cell without changes to create the two dataframes 

customer_details_df = pd.DataFrame({'CustomerID': [101, 102, 103],
                                    'Name': ['Alice', 'Bob', 'Charlie'],
                                    'City': ['Anytown', 'Otherville', 'Smallburg']})

loyalty_points_df = pd.DataFrame({'CustomerID': [101, 102, 103],
                                  'Points': [100, 250, 50]})

### Scenario 2 Task :  Merge the DataFrames on CustomerID

In [31]:
merged_customer_df = pd.merge(customer_details_df, loyalty_points_df, on = 'CustomerID')
merged_customer_df

   CustomerID     Name        City  Points
0         101    Alice     Anytown     100
1         102      Bob  Otherville     250
2         103  Charlie   Smallburg      50